label data_science_ending:
    scene black with diss
    "Три недели спустя."
    scene bg urfu rtf holl with diss
    "Вот чёрт! Уже третья отработка и все впустую. Математика это явно не мое, еще и без стипендии остался."
    "Нужно теперь думать, на что я буду жить."
    "Вроде кто-то говорил про фриланс и что там можно неплохо заработать."
    "Надо попробовать..."
    scene black with diss
    "Полгода спустя."
    scene bg home with diss
    "Очередное сообщение от старосты, что мне нужно скорее закрыть долги."
    "С работой на фрилансе я совсем забыл об учебе."
    "Заказы поступали один за другим, времени на учебу совсем не оставалось."
    "Вскоре институт перестал быть моим приоритетом и я решил отчислиться, о чем тут же сообщил старосте."
    #TODO Счастливая концовка, слайдшоу
    call ending(" ")
