label expulsion_ending:
    scene bg urfu rtf holl with diss
    "Наступило первое сентября"
    "Я был воодушевлен предстоящей учебой, новыми знакомствами, студенческой жизнью в целом..."
    "Но уже через неделю мои надежды рассыпались - первая двойка."
    scene bg expulsion
    play music "audio/Expulsion.mp3"
    "Долги начали копиться как снежный ком и желание учиться совсем пропало."
    "На момент первой сессии у меня было уже 23 долга и я получил недопуск."
    "Я решил отчислиться, чтобы перепоступить в другой институт..."
    call ending("Вас отчислили...")
