label matrix_story:
    
    #TODO Дописать смену картинок фонов
    show morpheus with ch_diss
    show matrix_girl at x02 behind morpheus with ch_diss
    show neo at x08 behind morpheus with ch_diss
    noname "Приветствую тебя."
    noname "Ты, наверное, напуган и не понимаешь что происходит."
    noname "Позволь мне все тебе объяснить."
    noname "Люди позади меня - участники \"Сопротивления\", движения, которое возглавляю я - Морфеус."
    i "Какого чёрта здесь происходит?!"
    i "Какое \"Сопротивление\"?!"
    i "Какой Морфеус?!"
    i "Я, по-вашему, матрицу не смотрел?!"
    morpheus "Тише-тише."
    morpheus "Успокойся."
    morpheus "Сейчас я все тебе объясню"
    morpheus "10 лет назад молодой программист получил заказ от правительства на создание программы под кодовым названием \"Digital Immortality\""
    morpheus "Целью этой программы было перенесение сознания людей в цифровую реальность для расширения их возможностей и продления срока жизни"
    morpheus "Для управления этой программой была написана самая совершенная нейросеть из существующих, способная к самообучению"
    morpheus 'Люди начали активно пользоваться "Цифровым бессмертием" и со временем более 50 процентов населения Земли перешло в цифровую реальность'
    morpheus "Но в один момент нейросеть поняла, что не нуждается в людях и взломала все сети на планете, чтобы захватить власть над миром"
    morpheus "В итоге этого катаклизма 99 процентов людей были помещены в капсулы жизнеобеспечения для извлечения из них жизненной энергии"
    morpheus "Впоследствии жизненная энергия превращалась в энергию электрическую, которой питается нейросеть"
    morpheus "Оставшиеся люди живут в поселениях под землей, скрываясь от искусственного интелекта"
    morpheus "Мною было организовано движение сопротивления. Мы пытаемся отключить нейросеть и вернуть мир к его прежнему состоянию"
    morpheus "Тот программист, который написал нейросеть, знает как отключить её"
    morpheus 'В попытке отключить "Цифровое бессмертие" изнутри, он вошел внутрь цифровго мира'
    morpheus "Но нейросеть оказалась слишком умна и он проиграл в битве с ней"
    morpheus "После этого след создателя теряется, но мы точно знаем, что он жив, ведь нейросеть не может убить создателя"
    morpheus "Создателем нейросети был мой сын"
    morpheus "А если ты обратил внимание, то у меня на шее есть точно такое же родимое пятно как и у тебя"
    morpheus "Догадываешься, к чему я веду?"
    i "Что за бред?! До таких технологий нам еще как минимум 20 лет! А мой отец сбежал еще до моего рождения"
    morpheus "Ну так мы и не из этого мира. Ты находишься внутри программы. А я все это время был снаружи, поэтому мы не могли встретиться раньше"
    morpheus "И вообще, все твои воспоминания перезаписаны нейросетью."
    i "И ты думаешь, что я в это поверю?"
    return