label matrix_win:
    show math_teacher with ch_diss
    "*Препод* странно взглянула на меня и сказала:"
    math_teacher "Я чувствую, что вы еще не совсем готовы к контрольной, поэтому я перенесу ее на следующую пару"
    hide math_teacher
    "Что?"
    "Это совпадение? Не думаю"
    "Слишком уж странно она на меня посмотрела, да и переносить контрольные, по рассказам второкурсников, не в её стиле"
    "Остаток пары прошел в обычном формате. Мы проходили новую тему, по которой потом тоже будет тест"
    scene bg urfu rtf holl with diss
    "После пары я отправился домой, чтобы вечером проверить одну теорию..."
    scene black with diss
    "Несколько часов спустя..."
    scene bg home night with diss
    "Я весь день думал над произошедшим"
    "Правда ли я могу попадать в чужие сны? Если это так, то мне стоит попробовать попасть в сон к другу"
    "Я сосредоточился на мыслях о нем и уснул"
    scene bg summer 2 with diss
    "Проснулся я уже стоя на волейбольной площадке рядом с другом"
    "Мы играли в пляжный волейбол два на два"
    show friend_anton with ch_diss
    anton "Подавай, твоя очередь!"
    i "Сейчас я им такую подачу навешаю!"
    "Я подкинул мяч и ударил со всей силы"
    "Видимо, это силы было многовато, потому что мяч перелетел в аут"
    "Антон рассмеялся"
    anton "Вот уж навешал, сила есть - ума не надо!"
    scene black with diss
    "После этих слов что-то невидимое вытащило меня из сна"
    "Это был будильник"
    scene bg home with diss
    "Пора идти на пары, там нужно будет постараться узнать от Антона о его сне"
    scene bg urfu rtf holl with diss
    show friend_anton with ch_diss
    anton "Привет, давно не виделись!"
    "Привет, и в правду давно, целых 16 часов!"
    anton "Представляешь, мне тут такой сон приснился!"
    anton "С самого утра не могу дождаться, чтобы рассказать тебе"
    anton "Летом я каждый день ходил играть в волейбол на местный пляж, а сегодня мне приснилось, что мы играем вместе, представляешь!"
    anton "При этом, такого не могло быть ни при каком раскладе, ведь тогда мы еще не были знакомы"
    anton "Ты должен был подавать и хвастался, что сейчас точно забъешь"
    anton "А по итогу, ты просто перекинул мяч в аут и нам пришлось принимать решающий мяч от противников..."
    hide friend_anton
    "Дальше я уже ничего не слышал"
    "Я был настолько поражен тем, что действительно могу попадать в чужие сны"
    "Но есть один нюанс, в таком случае, люди могут меня запомнить и заподозрить что-то неладное"
    "Но такими возможностями не разбрасываются, поэтому нужно её использовать по максимуму"