label neo_win:
    scene black with diss
    call autoskip_text_white("НЕКОТОРОЕ ВРЕМЯ СПУСТЯ")
    scene table_with_answers with diss
    "Что за черт?!"
    "Это и в правду те же задания, что и в моем сне"
    "Или не в моем..."
    "Я что, могу попадать в чужие сны?"
    "Какой-то бред"
    "Наверное мне просто очень сильно повезло..."
    "Ладно, мысли нужно оставить на потом, а сейчас перенести ответы и попытаться что-то решить, чтобы удостовериться в правильности"
    scene black with diss
    call autoskip_text_white("ВЕЧЕР ТОГО ЖЕ ДНЯ")
    scene bg home night with diss
    "До самого вечера мысли о посещении чужих снов не давали мне покоя"
    "Что если я могу проникнуть в сон любого человека и узнать у него что захочу?"
    "Тогда получается, что я могу красть мысли и идеи других людей!"
    "Я могу буквально залезать в голову к людям"
    "А там можно откопать все что хочешь..."
    "Нужно перепробовать все способы попасть в чужой сон"
    "И желательно конкретного человека"
    "Главное при этом не выдавать себя, иначе меня может поймать правительство и начать исследовать"
    "А такой участи мне не хочется"
    "Возможно, я получил маленькую сверхспособность, и теперь должен правильно и осторожно ею пользоваться"
    return