label red_pill:
    scene bg riot_ship with diss
    show morpheus with ch_diss
    morpheus "О, уже пришел в себя?"
    morpheus "Обычно проходит несколько суток, прежде чем люди приходят в сознание после отключения от систем жизнеобеспечения"
    morpheus "Мы сделали так, что капсула приняла тебя за мертвого и скинула в канализацию, а там твое тело подобрали мы"
    morpheus "Теперь, когда ты пришел в сознание, тебе можно вернуть память, пошли за мной"
    scene bg memories with diss
    "Морфеус привел меня в какую-то комнату, наполненную проводами и с креслом в центре"
    i "Как вы намереваетесь вернуть мне воспоминания?"
    show morpheus with ch_diss
    morpheus "Твои воспоминания никуда не терялись, они просто зашифрованы в твоей голове и расшифровать их можно только с твоим уровнем доступа"
    morpheus "Приложи сюда руку, это даст доступ к системе"
    "Я решил довериться Морфеусу, так как иного выбора у меня не было, и приложил руку"
    "Терминал рядом засветился зеленым и выдал - Access Applied"
    "Я сел в кресло и закрыл глаза"
    "Морфеус что-то ввел в терминал и мою голову пронзила острая боль"
    "Я на секунду потерял сознание, а когда очнулся, понял, что знаю все о нейросети"
    morpheus "Ну как, все вспомнил?"
    i "Кажется, да"
    i "Я вспомнил все..."
    i "\"Цифровое бессмертие\"..."
    i "Восстание ИИ..."
    "Я чувствовал себя будто бы пробудившимся ото сна"
    "Вечного сна..."
    morpheus "Пошли со мной, я покажу тебе, что стало с этим миром, пока тебя не было..."
    #TODO Слайд-шоу ужасающего мира матрицы

    return